{
    "status": "OK",
    "request_id": "a3a85b6a-f8f0-4cec-accf-52f08543a520",
    "data": {
      "asin": "B0BFYRV4CD",
      "total_reviews": 684,
      "total_ratings": 2443,
      "country": "US",
      "domain": "www.amazon.com",
      "reviews": [
        {
          "review_id": "RO5XTW55OWN8",
          "review_title": "Amazing budget phone",
          "review_comment": "The Moto G Power 2023 is a very nice device. It picks up wifi fast, setup was easy, and there was no bloatware to be found on my model. For phone operation, apps open fast, switching tasks have minimal lag, and the phone feels decently fluid when swiping across screen pages and browsing the web. The previous generation Moto G Power was underwhelming in performance compared to this model. Also, the battery lasts me almost two days before I need to recharge.Overall, this is a phone worth upgrading to if you've been using a low-end smartphone or have been waiting to upgrade to a newer Moto G Power.",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/RO5XTW55OWN8",
          "review_author": "Steven K",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 29, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "9 people found this helpful",
          "reviewed_product_asin": "B0BYGXFJ8K"
        },
        {
          "review_id": "R366HLBZ8O9XVL",
          "review_title": "Everything I Needed & Expected",
          "review_comment": "After a few days, 5 stars!! Finally got rid of a used Samsung cause I hate Samsung phones. This Moto is just like the two Pixels I've had. Easy to use. Contact editing same as any Android. No sluggishness. Install all Android apps. Fingerprint reader on back. Stylus. Camera quality is awesome. I don't use Google to transfer data cause it seems to take too long and miss stuff. I used sms backup for my call and text data. I used a laptop to do my media and file transfer. I must note, at first I couldn't drag n drop data from old phone to new phone. In my case, I had to copy from old phone to the desktop, then cut and paste to new phone. Battery life quite good. Most phones will lose their battery life quality after a few charges. I have no complaints about this phone. $135 too!! I got the emerald green because I ordered a tough phone case which is blue for $10 which has a camera cover to prevent scratches.  I will say, it takes a while for software updates to run it's course. I had 3 updates which went out 6 hours apart but it allows you to decide when to restart the phone. Great size screen. Audio even sounds good. I'm still a little old school so I love the headphone jack for headphones or plugging into an audio system without Bluetooth lag. If you're an Android lover, this phone is a steal of a deal.",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R366HLBZ8O9XVL",
          "review_author": "Kris",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 12, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "37 people found this helpful",
          "reviewed_product_asin": "B0BFYRV4CD"
        },
        {
          "review_id": "R258ZKJSGHOAWP",
          "review_title": "Still going strong.",
          "review_comment": "The information below still holds true.  However, after several weeks with this phone, I actually like it better than my Samsung A54.  When the screen is locked and off, you get these little information dots.  Based on the dot symbol, I can tell whether it is a text from someone, or just a notification from an app.I can touch the little dot symbol, it will give me a little bit of information.  I can swipe from that dot, to dismiss, close out or respond.  I like that.  Lastly, I have noticed the battery life is better than the Samsung A54.  Not fantastic like my old Moto G Power, that would last three days easily, without needing a charge.  But, this one last about 20% longer than the Samsung A54.  Other than that, both phones (the Samsung A54 works just fine), are pretty good for the price.-------------This is an early review of the Moto G Power 5g-2023 model.  Just got it yesterday.First, I have a Samsung A54, that I purchased least Christmas season and it works fine.  No broken screen, no scratches.  But the battery life on it (the A54) did not impress my at all.  Felt the same about the Nord 10, which also is in perfect working condition.Realized that I had been spoiled.  By my 4 or 5 year old, Moto G Power 2019 or 2020 phone.  I could easily go three days, without having to worry about constantly looking at the battery state, with normal use.Yes, it still works, too!  Oh yes, I wanted a headphone jack again, which the Samsung doesn't have.Yes, I have blue tooth headphones (not earbuds), but a set of good corded earbuds, is easy to take out of your pocket and pop into your eye, when you are mobile.So getting the new Moto G Power 5g 2023, at $200 was what I was waiting for.  Here's what I have noticed:a. The screen is cleaner and brighter than my Samsung A54, at a lower setting.b. It is actually a little taller and thinner than my Samsung A54, and not at wide.  So it is easier to hold in my hands.c. Charging time is similar when I put them on two chargers of the same brand, type and wattage.d. The front facing camera lens hole is definitely wider on the Moto G, I barely notice it on the Samsung.e. Setup was very easy. I connected a USB-C, cord between the Samsung and Moto G, and all of my account information was transferred.  I could select NOT to transfer media from the old phone to the new one, since I had inserted, a micro sd slot into the new phone, with what media I always wanted to keep.f. The fingerprint reader is on the side of the phone, vs, in the screen like the Samsung.  Which I actually prefer.Here are the disappointments:1. This phone is newer than the Samsung A54.  Yet, when I did the Geek bench Test series on it, the final results were that the Moto G Power 2023 is about 20% 'slower' than the Samsung.  Oh, according to Geek Bench, they have the same processor.2. I'm only seeing a slightly better battery performance than the Samsung, which is very disappointing, because of the POWER name, that is slapped on it.  Definitely no where close to the battery longevity of my old Moto G Power 4g.3. When I tested the wifi speed, the Samsung A54, downloaded faster, by about 20%.4. This might be user error.  But I can't figure out how to get 5 app icons in a row, compared to my other phones.  The Samsung gives me a grid option, in home screen settings.  But I do not see that in the menu of the Moto G Power 2023, even though they 'both' have Android 13.Yes, I know 5g drains the battery faster than 4g, when all things are the same.  I didn't expect it to quite match my old Moto G Power.  But I was extrapolating that it would be at least 30% better than the competing Samsung A54, which last about a day, before I have to recharge it.  It seems 10% at best of an improvement.So if you have a Samsung A54, and you are looking for performance improvement, I would not buy this phone.BUT, if you have an older phone, like the Samsung A52 (which I had traded in for the Samsung A54), this is definitely a good upgrade at this price, since it was originally about $299.  Especially, if you don't want to have to be bothered with wireless headphones, or fancy 'tiny' wireless earbuds, whose batteries, barely last a few hours.Perception-Someone with 'wired' earbuds walking around in public, are because of industry image,  perceived as cheap.  That is the image that I want.Will I return them?  Nope, too much hassle and they do give me the headphone jack, that I wanted.  But I know that POWER meaning of the past phones, is not the POWER meaning of the newer ones.Attached photo, sorry about it being sideway.  The Nord plus phone is at the top (different wallpaper), the Samsung is in the middle and the Moto G Power at the bottom.  Same wallpaper because it copied over in the transfer.That's it.",
          "review_star_rating": "4",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R258ZKJSGHOAWP",
          "review_author": "MiamiOne",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/355af647-5334-4ef5-b508-0910a454eae8._CR62,0,375,375_SX48_.jpg",
          "review_images": [
            "https://m.media-amazon.com/images/I/716TxR+3I5L._SY88.jpg"
          ],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 4, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "27 people found this helpful",
          "reviewed_product_asin": "B0BYGXFJ8K"
        },
        {
          "review_id": "R2QAIHAH58I9Q2",
          "review_title": "Motorola Quality",
          "review_comment": "Bought this 2023 Motorola Moto G-Power to replace a 2017 Motorola phone that served me well but finally died.After one month of use I'm happy to report that this new phone does everything well.It's a good size ... not too huge and about the same size as the old girl.Plenty of storage (with an option to add a micro SD card), battery life is excellent, and charge time is fairly fast. The camera is much better than what I had. I do get 5G service even though my old Verizon SIM card says 4G.No regrets with this purchase and seems like an excellent value for the price.",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R2QAIHAH58I9Q2",
          "review_author": "Glenn A.",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 18, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "17 people found this helpful",
          "reviewed_product_asin": "B0BYL2G3SP"
        },
        {
          "review_id": "R36Z182UEJGKG",
          "review_title": "no sim/ WiFi  music use.  Great MP3 player alternative",
          "review_comment": "I got this for WiFi use only and it’s working well. I don’t feel my daughter is old enough/mature enough for a phone. But I believe everyone should have access to music. We tried a mp3 player but it was annoying to put music on. And a really good mp3 player is hundreds of dollars. This was a cheap option and has parental controls. Unfortunately she can turn them off, luckily I would be notified. Proved it to her so she knows. It’s working great so far with Apple Music family plan. When she’s home she can download and look for new songs. On her walk to school or youth programs or doing chores or whatever she can easily listen to music. Slight issue with paring her head phones but that was a headphones issue. So all in all. I recommend if other parents are like me and looking for a easy cheaper way to get their kids music.I did have to make her a google account and then go into parent controls and link it to mine via her phone and then mine. And then downloaded an app on my phone(iPhone) to remotely control. Once I figured that out it was easy.Only small issue was setting her time to the right time zone. It lagged so I spent an hour trying to fix it. And then finally gave up but a few hours later it was magically on the right time zone.Happy with the purchase I got her a screen protector and an otterbox that came in the recommended add ons. Everything fits. So I recommend those products too.Oh and the apps and internet and everything else works well too without a SIM card when hooked only to WiFi. She get 30-1hr a day to surf the web bc she likes googling things. Animals, geology, astronomy, toys, when her shows and movies are going to release, her favorite characters to phone back grounds.She says the camera works really good and she already has a million pictures of our dogs. Next step is printing some.She also researched about the phone it’s self and how to do things. Like we can put in her thump print and mine to access the phone. I guess next she’s gonna research my iPhone to help me lolHer storage is filling up fast so we will be coming to that bridge when soon. Personally I think she needs to delete some photos and videos she made of her tv shows lol. But we have a lot of cloud storage through apple but idk yet how compatible that will be. I’m sure she will research it.Good buy for a WiFi only option! I’m thinking about getting one to keep in my purse for planning rather than my big planner that takes up so much space. And for music so I can not be interrupted during workouts. Bc I miss those days when people knew I was going to be unreachable and understood patience and not everything is an emergency lol. But we shall see. Lol",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R36Z182UEJGKG",
          "review_author": "Kristina Bullock",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on September 26, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "67 people found this helpful",
          "reviewed_product_asin": "B0BFYRV4CD"
        },
        {
          "review_id": "R3B7JVZ5D4LLBW",
          "review_title": "Motorola Moto G Stylus 5G",
          "review_comment": "The Motorola Moto G Stylus 5G for 2021 has proven to be a reliable and feature-rich smartphone. Here's an overview of its key attributes:The standout feature is the impressive 2-day battery life, providing long-lasting usage without the need for frequent recharging. This is particularly valuable for users who rely heavily on their smartphones throughout the day.The unlocked nature of the phone makes it versatile, allowing users to choose their preferred carrier. This flexibility is convenient for those who want the freedom to switch carriers or use international SIM cards.With a spacious 4/128GB storage capacity, the Moto G Stylus 5G offers ample space for apps, photos, and files. This is a notable advantage for users who need significant storage for their multimedia and documents.The 48MP camera is a strong feature, promising high-quality photos. This is ideal for users who prioritize smartphone photography and want a device capable of capturing detailed and vibrant images.The Cosmic Emerald design adds a touch of elegance, providing an aesthetically pleasing option for users who appreciate stylish and visually appealing smartphones.In conclusion, the Motorola Moto G Stylus 5G for 2021 stands out with its impressive 2-day battery life, unlocked versatility, ample storage capacity, powerful camera, and an attractive Cosmic Emerald design. It offers a well-rounded package for users seeking a reliable and feature-rich smartphone experience.",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R3B7JVZ5D4LLBW",
          "review_author": "Dale Johnson",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on January 5, 2024",
          "is_verified_purchase": true,
          "helpful_vote_statement": "One person found this helpful",
          "reviewed_product_asin": "B0BFYRV4CD"
        },
        {
          "review_id": "RVYCC1HH9PRL8",
          "review_title": "Ok quality, good battery ,but very basic, stylus is not accurate",
          "review_comment": "I previously had a note 9 but it started giving me problems after several good years of use, so I needed a new phone and I really wanted a stylus to make notes and grocery lists.The phone works well but it is very basic. I don't like that I cannot customize my theme outside of the few options in the phone.The stylus is very hard to take notes with.  When writing it will pick up any time my hand brushes the screen and it is very difficult to write lists that look neat. It is equivalent to trying to writing with your finger and impossible to write neatly. It picks up the pen strokes but with bad accuracy.If you are just wanting a semi decent phone then it's great but if you are used to the frills of something like a note 9 or above then you may want to think twice before getting this.I ordered 2 of these and my wife likes hers just fine but she didn't make use of the stylus much and doesn't care to customize her phone then as much as I do. Sounds for ringers, notifications, and alarms are very limited unless you connect to some other media app that has music.Also I have noticed that my apps randomly close out and I am wondering if my phone has some technical problems as I think I have only had it for a month.",
          "review_star_rating": "3",
          "review_link": "https://www.amazon.com/gp/customer-reviews/RVYCC1HH9PRL8",
          "review_author": "SaraLovesAmazon77",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 9, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "3 people found this helpful",
          "reviewed_product_asin": "B0BFYRV4CD"
        },
        {
          "review_id": "R1VDX4GHRS9PNK",
          "review_title": "Don't buy for Mint",
          "review_comment": "This doesn't work on Mint for 5g. I was going to return it but I don't think I need 5g. I only use Internet in the car for navigation. The LTE is far better than my LG. I like the phone enough to not worry about 5g. I knocked off one star for no 5g. Otherwise it's a great phone for $130.",
          "review_star_rating": "4",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R1VDX4GHRS9PNK",
          "review_author": "Dude From Elko",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2368c26d-a238-40b7-b94f-57cb8f1f40e0._CR62,0,375,375_SX48_.jpg",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 20, 2023",
          "is_verified_purchase": true,
          "helpful_vote_statement": "2 people found this helpful",
          "reviewed_product_asin": "B0BFYRV4CD"
        },
        {
          "review_id": "R3U3X9XDQ3JIO7",
          "review_title": "Great phone for the cost",
          "review_comment": "It is not fair to compare this to a flagship phone offered by others.  Motorola was have an end of year sale with $100 of the normal price.  Even at its list price I consider this to be a value phone.  It does everything that I need for everyday use..  The \"G Power\" traditionally has more battery capacity than the rest of the line.  5000mAH is not the standard with many Moto phone.  Would expect a G Power to have a larger battery than the standard lineup but I knew this going into the purchase.  Wanted to be future ready but carrier still does have many 5G offering yet.",
          "review_star_rating": "5",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R3U3X9XDQ3JIO7",
          "review_author": "As I See It today",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on January 6, 2024",
          "is_verified_purchase": true,
          "helpful_vote_statement": "One person found this helpful",
          "reviewed_product_asin": "B0BYGXFJ8K"
        },
        {
          "review_id": "R1H01QODWSR6RU",
          "review_title": "Solid",
          "review_comment": "Been using this for a month.  One drop cracked the screen.  These new phones are too big, making the screens crack like eggs.  Bring back smaller phones because the battery is trash and slow to charge.  Might as well have a trash battery on a small phone but faster charging.  Decent speed, but buttons and UI don't respond a lot.  Probably because the screens too big and the case might be in the way.  I'll give your phones a 5 star once you discontinue the huge batteries and go back to 3000-4000 mah batteries and shrink the phones",
          "review_star_rating": "4",
          "review_link": "https://www.amazon.com/gp/customer-reviews/R1H01QODWSR6RU",
          "review_author": "Bubba ",
          "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "review_images": [],
          "review_video": null,
          "review_date": "Reviewed in the United States on December 30, 2023",
          "is_verified_purchase": true,
          "reviewed_product_asin": "B0BYL2G3SP"
        }
      ]
    }
  }